Revit 2027 API
TopographySurface.IsValidFaceSet Method
 Identifies whether the facets can construct a valid topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFaceSet(
	IList<PolymeshFacet> facets,
	IList<XYZ> points
)
Public Shared Function IsValidFaceSet (
	facets As IList(Of PolymeshFacet),
	points As IList(Of XYZ)
) As Boolean
public:
static bool IsValidFaceSet(
	IList<PolymeshFacet^>^ facets,
	IList<XYZ^>^ points
)
static member IsValidFaceSet :
        facets : IList<PolymeshFacet> *
        points : IList<XYZ> -> bool
Parameters
facets IList<PolymeshFacet>
 The facets to be checked.
points IList<XYZ>
 A collection of points.
Return Value
Boolean
 True if the facets are valid, otherwise false.
Exceptions
Exception | Condition
ArgumentException |  There are no points in the input points set. -or- There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace